# Задача: Управление динамической памятью с указателями

Напишите программу на C++, которая выполняет следующие действия:

1. Динамически выделяет память для переменной типа `int` и присваивает значение.
2. Создает два указателя, которые будут указывать на одну и ту же область памяти.
3. Создает указатель на указатель, который ссылается на один из указателей.
4. Изменяет значение через указатель на указатель и проверяет, что оба указателя указывают на измененное значение.
5. Освобождает выделенную память корректно, чтобы избежать утечек памяти.

Добавьте в программу две одинаковые функции incrementPointer, увеличивающие значение переменной, первая принимает параметр через указатель, вторая - чере ссылку. Вызовите эти функции для любой переменной и выведите её на экран,

## Скелет кода программы

```cpp
#include <iostream>

// Функция, увеличивающая значение через указатель
void incrementPointer(int ???, int increment) {
    ???
}
// Функция, увеличивающая значение через ссылку
void incrementReference(int ???, int increment) {
    ???
}

int main() {
    // 1. Динамическое выделение памяти для переменной int со значением 10, указатель ptr1 указывает на это область

    std::cout << "Разыменовать ptr1: " << ???  << std::endl;

    // 2. Создание второго указателя ptr2, указывающего на ту же область памяти

    std::cout << "Разыменовать ptr2 (то же, что и ptr1): " << ??? << std::endl;

    // 3. Создание указателя ptr3 на указатель ptr1


    // 4. Изменение значения 10 на 20 через указатель ptr3 на указатель

    std::cout << "Разыменовать ptr1 после изменения ptr3: " << ??? << std::endl;
    std::cout << "Разыменовать ptr2 после изменения ptr3: " << ??? << std::endl;

    // 5. Освобождение памяти


    return 0;
}
```

## Ожидаемое поведение

- После изменения значения через указатель на указатель (`ptr3`), оба указателя (`ptr1` и `ptr2`) будут показывать новое значение.
- Освобождение памяти должно быть выполнено через один из указателей, чтобы избежать утечек памяти.